[
    {
        "blogTitle": "5 DORM ESSENTIALS YOU CAN'T FORGET",
        "image": "https://bysophialee.com/wp-content/uploads/IMG_2760-1152x1536.jpg",
        "tags": [
            "Storage Cubbies",
            "Mini Fridge",
            "Shower Shoes",
            "Microwave",
            "Plastic Drawers"
        ],
        "topics": [
            {
                "title": "Storage Cubbies",
                "description": "Dorm rooms are so tiny, you're definitely going to have to come up with ways to create storage in it. I highly recommend storage cubbies of any kind. My freshman year,  I just got some canvas bins like these ones from Amazon and they worked wonders. I stored makeup, snacks, school supplies, even shoes in them! So whatever you do, bring some cubbies to your dorm."
            },
            {
                "title": "Mini Fridge",
                "description": "This item was such a dorm essential my freshman year that I truly do not know what I would have done without it! If you can, I highly suggest bringing a mini fridge. It's so nice to be able to store water bottles and small snacks like fruit cups in it. That way when you get hungry, you don't have to go all the way to the dining hall for a banana and a water bottle. You can just hop out of bed and grab it from your dorm room!"
            },
            {
                "title": "Shower Shoes",
                "description": "Going along with the dorm essentials for the shower idea, another item you will most definitely need are shower shoes. The showers in dorm bathrooms are not ideal, so save the possibility of getting sick or infected by getting some shower shoes. The good news is that cheap flip flops or slides work perfectly, so you don't have to go spend a fortune on them!"
            },
            {
                "title": "Microwave",
                "description": "Having a microwave in your dorm room is another huge dorm essential. It heats up leftovers, it makes quick frozen meals, it heats up snacks or popcorn for movie night. Or coffee that's gotten cold while studying. If you're moving into a dorm, you need a microwave."
            },
            {
                "title": "Plastic Drawers",
                "description": "Dorms aren't very prepared for the masses of clothes that freshman are convinced they need to bring to college. So to make room for all those clothes, I highly suggest buying a couple of the plastic container drawers and storing all your t-shirts, shorts and leggings in them. Keep them under your bed to maximize space, too. It's a must have dorm essential, for sure!"
            }
        ]
    },
    {
        "blogTitle": "WHAT NOT TO BRING TO COLLEGE",
        "image": "https://bysophialee.com/wp-content/uploads/what-NOT-to-bring-to-college-4-1024x780.png",
        "tags": [
            "TOO MANY PILLOWS",
            "PRINTER",
            "IRONING BOARD",
            "BED RISERS"
        ],
        "topics": [
            {
                "title": "TOO MANY PILLOWS",
                "description": "One of my biggest mistakes freshman year was paying Home Good's rent with the number of throw pillows I bought from them for my dorm room. I LOVE throw pillows. I loved them then and still love them now. However, my throw pillows and I went through a little bit of a rocky stage in my dorm room because I brought so many dang pillows and had nowhere to put them! After doing that for a semester, I now recommend you stick with two throw pillows on your bed (at max) and one or two on your futon. That's IT. You will regret having any more than that!"
            },
            {
                "title": "PRINTER",
                "description": "Having a printer in college is a big pain. I never actually brought a printer to school but I had friends who did and always complained about it getting in the way. It's almost guaranteed that your dorm will have printers available for you to use. I have never heard of a dorm room these days that doesn't have a printer available to the students living there. Another pro to not bringing a printer to school - printer ink can be expensive! Use the printing credits you receive as part of your tuition (you do pay for them after all)."
            },
            {
                "title": "IRONING BOARD",
                "description": "An ironing board is definitely something you should not bring to your college. Ironing boards are super large and will take up a ton of space. Instead, invest in a mini steamer. Not only is this a lot more storable it is also a lot less work. An ironing board takes up a lot of space and you will most likely only use them once, if at all."
            },
            {
                "title": "BED RISERS",
                "description": "Don't have much to say about these other than that they are completely useless. Dorm beds (usually) are built now to be adjustable to the height you want them at. The 4 inches your bed risers will lift your bed is just an annoying four inches that make you have to jump higher every time you get into your bed."
            }
        ]
    },
    {
        "blogTitle": "WHAT I WISH I KNEW BEFORE GOING TO COLLEGE",
        "image": "https://modernteen.co/wp-content/uploads/2020/03/three-persons-sitting-on-the-stairs-talking-with-each-other-1438072-1.jpg",
        "tags": [
            "Your Tuition Doesn't Cover Everything",
            "Plan Ahead Using An Agenda",
            "There Are A Lot Of Free Resources On Campus",
            "The First Semester Is REALLY HARD",
            "Find A Flexible Job"
        ],
        "topics": [
            {
                "title": "Your Tuition Doesn't Cover Everything",
                "description": "With how much I was paying in tuition, I went into college thinking I was good to go. I was very wrong. There are a lot of extra expenses that your tuition doesn't cover that I hadn't even though about such as books, class kits, or website access codes you literally have to pay for to do your homework. I would definitely suggest having a couple thousand dollars extra to make sure you have enough to cover these expenses every semester."
            },
            {
                "title": "Plan Ahead Using An Agenda",
                "description": "Having a printer in college is a big pain. I never actually brought a printer to school but I had friends who did and always complained about it getting in the way. It's almost guaranteed that your dorm will have printers available for you to use. I have never heard of a dorm room these days that doesn't have a printer available to the students living there. Another pro to not bringing a printer to school - printer ink can be expensive! Use the printing credits you receive as part of your tuition (you do pay for them after all)."
            },
            {
                "title": "There Are A Lot Of Free Resources On Campus",
                "description": "An ironing board is definitely something you should not bring to your college. Ironing boards are super large and will take up a ton of space. Instead, invest in a mini steamer. Not only is this a lot more storable it is also a lot less work. An ironing board takes up a lot of space and you will most likely only use them once, if at all."
            },
            {
                "title": "The First Semester Is REALLY HARD",
                "description": "Don't have much to say about these other than that they are completely useless. Dorm beds (usually) are built now to be adjustable to the height you want them at. The 4 inches your bed risers will lift your bed is just an annoying four inches that make you have to jump higher every time you get into your bed."
            },
            {
                "title": "Find A Flexible Job",
                "description": "Speaking of money, it is essential you find a flexible job in college. This can be anything from a remote job you can do on your own time to part time jobs you can work when you don't have class. It is a little stressful to balance school and work at first, but after a while you will find a good schedule and you will end up love having the extra cash."
            }
        ]
    }
]